fpclassifier/app/controllers/posts_controller.rb

INSERT INTO `posts` (`create_date`, `created_at`, `keyword`, `thought`, `updated_at`) VALUES ('2013-03-21', '2013-03-21 21:59:44', '#development', 'I am testing this out to see what happens!', '2013-03-21 21:59:44')
---
  def create
    thought = params[:post][:thought]
    keyword=""
    @post = Post.new
    @post.thought = thought
    @post.keyword = keyword
    @post.create_date = DateTime.now